Revit 2024 API
AlphanumericRevisionSettings.Prefix Property
 The prefix string that will be prepended to the number of each revision with Alphanumeric RevisionNumberingType.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2016
Syntax
C#
public string Prefix { get; set; }
Visual Basic
Public Property Prefix As String
	Get
	Set
Visual C++
public:
property String^ Prefix {
	String^ get ();
	void set (String^ value);
}
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentNullException |  When setting this property: A non-optional argument was null
See Also
AlphanumericRevisionSettings Class
Autodesk.Revit.DB Namespace